[{"title_": "onepot-paneer-curry-pie", "summary": "", "ingredients": [], "steps": []}, {"title_": "beer-mac-n-cheese", "summary": "A staple of Manhattan's East Village, Emma Freud's cheddar and pale ale pasta dish is the ultimate comfort food", "ingredients": ["50g butter", "2 garlic cloves, grated", "50g spinach", "500ml milk", "250ml  pale ale", "220g  macaroni", "100g cheddar, grated", "200g   mozzarella, grated"], "steps": ["Heat the grill to its highest setting. In a flameproof casserole dish or metal frying pan, melt the butter and fry the garlic for 2 mins. Add the spinach and cook until it wilts, about 2 mins. Pour in the milk and beer and bring to a gentle bubble. Add the macaroni and stir intermittently for around 20 mins until the pasta is cooked and covered in sauce.", "Stir in the cheddar and half the mozzarella. When it starts to melt, sprinkle the remaining mozzarella on top and put it in the oven for around 7-10 mins or until browned on top and sensational underneath.", "Recipe from Good Food magazine, August 2016", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "homity-pie", "summary": "Make a veggie showstopper in this homity pie – a creamy potato, onion and cheese pie, with the addition of leeks. Make it your own with more veg, if you like", "ingredients": ["25g butter", "2 onions, finely sliced", "1 leek, finely sliced (optional)", "1 tbsp thyme leaves (optional)", "700g floury potatoes (such as Maris Piper or King Edward), quartered and thickly sliced", "150ml double cream", "125g mature or extra-mature   cheddar, grated", "2 spring onions (optional), finely chopped", "200g plain flour, plus extra for dusting", "50g wholemeal or rye flour", "pinch of   cayenne pepper (optional)", "125g butter", "1 egg"], "steps": ["To make the pastry, tip both the flours, a pinch of salt and the cayenne, if using, into a large bowl. Mix, then rub in the butter using your fingertips until the mixture is crumbly. Mix in the egg and 1 tbsp cold water using a cutlery knife. Bring the pastry together into a ball, then cover and chill for 30 mins. Knead briefly until pliable, then roll out until it’s large enough to line a 20cm deep pie dish. Line the dish, pushing the pastry into the edge, then trim. Chill until needed.", "Meanwhile, for the filling, heat the butter in a large saucepan until sizzling and cook the onions with some seasoning and the leeks and thyme, if using, for 12-15 mins until soft and sticky. Stir the potatoes into the onion mix, then reduce the heat, cover and cook for 10-15 mins, stirring occasionally, until the potatoes break down when pressed with a wooden spoon. Pour over the cream, stir for a minute, then turn off the heat and leave to cool a little.", "Heat the oven to 200C/180C fan/gas 6 with a baking tray inside. Stir half the cheddar and most of the spring onions through the potato and onion mix. Scatter half of the remaining cheddar over the base of the pastry case, then tip in the tip filling. Scatter with the rest of the cheese and spring onions. Bake on the hot baking tray for 40-45 mins until the pastry is deeply golden and the filling is bubbling. Remove from the oven and leave to rest for at least 10 mins. Serve hot, or leave to cool until just warm.", "RECIPE TIPS", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "italian-veggie-cottage-pie", "summary": "An Italian twist on an English classic, with sundried tomato, spinach and aubergine, this veggie pie makes a super budget supper", "ingredients": ["4 tbsp olive oil", "2 aubergines, cut into chunks", "2 large garlic cloves, crushed", "16   sundried tomatoes, roughly chopped, plus 1 tbsp of their oil", "2 tsp dried oregano", "400g spinach, washed", "50g plain flour", "400ml milk", "125g cheddar, grated, plus extra to top", "800g   ready-made mashed potato (fresh not frozen)"], "steps": ["Heat oven to 220C/200C fan/gas 7. Heat 1 tbsp of the oil in a large, lidded frying pan or flameproof casserole dish. Cook the aubergine, in two batches, over a high heat for 4-5 mins until golden, adding extra oil as you need to. Return all the aubergine to the pan with the garlic, tomatoes and 1 1/2 tsp oregano and cook for 1 min. Stir in the spinach, put the lid on the pan and leave for a few mins to wilt.", "Add the flour and stir through until combined. Pour in the milk, stir gently and bring to the boil. Bubble for a few mins, then stir in the cheese and season. Cook until the cheese has melted and the sauce has thickened.", "Mix the mash with the remaining oregano and spread over the filling. Scatter over a little more grated cheese and bake for 10-15 mins until golden.", "Recipe from Good Food magazine, September 2016", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "next-level-ratatouille", "summary": "Seasonal vegetables are all slow-cooked together ina dish that truly celebrates summer. Serve with bread, or for a more substantial meal,as a sidewithbarbecued or roasted meat or fish", "ingredients": ["3 red peppers , each quartered and deseeded", "handful basil , leaves and stalks separated", "large thyme sprig", "2 tbsp olive oil , plus extra for frying and drizzling", "2 courgettes (different colours are good), roughly chopped", "1 aubergine , chopped into large chunks", "1 red onion , roughly chopped", "4 garlic cloves , sliced", "pinch sugar", "1 tbsp  red wine vinegar", "2 x 400g cans cherry tomatoes", "1 tbsp extra virgin olive oil", "griddled sourdough , to serve"], "steps": ["Heat the grill to high. Lay the pepper quarters skin-side up on a baking tray and grill until the skins are black and charred. Tip into a bowl, cover and leave to cool. Peel the charred skin off the peppers, then cut into strips, and toss back in the juices collected in the bowl. Tie the basil stalks and thyme sprig together using kitchen string and set aside.", "Heat the oven to 160C/140C fan/ gas 4. Heat the olive oil in a flameproof casserole dish and fry the courgettes and aubergine for 15 mins until nicely browned. You may need to do this in batches, adding more oil to the pan as needed so the pan is never dry.", "Scoop the veg out of the pan and set aside. Add a drizzle more oil, tip in the onion and cook for another 15 mins until softened and starting to brown. Add the garlic and leave to sizzle for a moment. Scatter with sugar, then leave for a minute to caramelise and splash in the vinegar. Stir in the cooked vegetables along with the pepper juice, season generously, pour over the cans of tomatoes and bring everything to a simmer.", "Nestle in the herbs, cover the dish and transfer to the oven for 1 hr. Remove the lid and give it another 30 mins until everything is cooked down and jammy. Leave the ratatouille to cool until just warm, then stir through most of the basil leaves and the extra virgin olive oil. Scatter with the rest of the basil and serve with griddled sourdough. ", "Recipe from Good Food magazine, August 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "triple-cheese--aubergine-lasagne", "summary": "Fill sheets of pasta with tomato, aubergine and ricotta for a delicious vegetarian main - perfect for feeding a crowd", "ingredients": ["12-16   fresh lasagne sheets", "4 tbsp olive oil", "3 large aubergines , cut into small chunks", "2 large onions , chopped", "4 garlic cloves , finely chopped", "2 x 400g cans chopped tomatoes", "2 tbsp  tomato purée", "1 tsp golden caster sugar", "pinch of chilli flakes", "small handful  basil leaves , finely chopped", "dash of soy sauce", "500g ricotta", "50g parmesan (or vegetarian alternative) finely grated", "2 medium eggs , beaten", "¼ tsp grated  nutmeg", "500g milk", "50g plain flour", "50g butter", "100g mature cheddar , grated", "1 tsp English mustard"], "steps": ["First, make the tomato & aubergine sauce. Heat 1 tbsp of the oil in a large non-stick frying pan and cook the aubergine in 3 batches, adding 1 tbsp oil for each batch. They should be softened and lightly golden.", "Add the remaining oil to the pan and cook the onions for 5 mins until softened. Stir in the garlic, cook for 1 min more, then return the aubergine to the pan with the tomatoes, tomato purée, sugar and chilli flakes. Bring just to the boil, then turn down to a simmer and cook for 10 mins. Take off the heat, stir in the basil and soy sauce, and season to taste.", "Mix together all the ingredients for the ricotta filling, season and set aside – or cover and leave in the fridge if making in advance. Both the aubergine and the ricotta sauce can be chilled for up to 2 days.", "For the cheese sauce, add all the ingredients to a pan and cook over a medium heat, stirring all the time, until it thickens and the cheese has melted, then turn down the heat to low and cook for another 5 mins. Season to taste.", "Heat oven to 180C/160C fan/gas 4. To assemble the lasagne, spoon half the aubergine mixture into the bottom of a large baking dish. Top with a layer of lasagne sheets, then spread over a ricotta layer. Add another layer of lasagne sheets, followed by the remaining aubergine mixture and another layer of lasagne sheets. Pour over the cheese sauce (it can now be frozen for 1 month – defrost before cooking). Bake in the oven for 50 mins-1 hr until golden and heated through.", "Recipe from Good Food magazine, December 2014", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "melty-cheese--potato-pie", "summary": "Drawing from the apres-ski classic tartiflette, this indulgent pie transformsinto a cheesy fondue with creamy sliced potatoes and crisp puff pastry", "ingredients": ["750g   floury potatoes (such as King Edwards), sliced", "100ml crème fraîche", "pinch of freshly grated nutmeg", "plain flour, for dusting", "2 x 375g   blocks of all-butter puff pastry", "250g   round camembert (or vegetarian alternative)", "1 egg, beaten", "1 shallot, finely chopped", "2 tsp Dijon mustard", "2 tbsp  red wine vinegar", "100ml olive oil", "500g chicory (I used red and white for colour contrast), leaves separated"], "steps": ["Heat oven to 220C/200C fan/gas 7. Tip the potatoes into a pan of cold water, bring up to the boil and cook for 2 mins. Drain well, tip back into the saucepan and mix with the crème fraîche. Season, sprinkle over the nutmeg and set aside.", "Dust your work surface with flour, roll the first block of pastry to a circle about 28cm wide and place on a baking tray. Arrange a third of the potatoes in the middle of the pastry, then sit the cheese on top. Pile the rest of the potato around the cheese, leaving a 1cm border at the edge of the pastry.", "Roll the remaining pastry out to a circle about 30cm wide, dusting with more flour if needed. Brush the edges of the pastry on the tray with egg, then drape over the larger circle and seal the sides well, crimping as you go round. A tight seal is important to stop the cheese escaping.", "Brush all over with egg and lightly score a spiral into the pastry with the back of a knife. Bake the pie for 30 mins until golden brown and puffed up. As soon as the pie comes out of the oven, glaze with a little more egg and leave to cool for 5 mins.", "Meanwhile, whisk the shallot, mustard, vinegar and oil together. Place the chicory in a bowl and toss with the dressing. Serve the pie cut into oozy wedges, with the salad on the side.", "Recipe from Good Food magazine, January 2016", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "smoky-spiced-veggie-rice", "summary": "Try this vegan take on a jambalaya, full of fiery and smoky flavours and bursting with vegetables. It's healthy, low in fat and calories,yet big on flavour", "ingredients": ["25g cashews", "4 tbsp olive oil", "1 corn cob", "250g rainbow baby carrots , halved lengthways", "2 red onions , finely chopped", "2 celery sticks , finely chopped", "2 large red peppers , finely sliced", "3 garlic cloves , crushed", "2 tbsp  Cajun seasoning", "1½ tbsp smoked paprika", "1 tsp  chipotle paste", "2 tbsp  tomato purée", "200g heirloom cherry tomatoes , halved", "400g can kidney beans , drained and rinsed", "400g can cherry tomatoes", "300g   long-grain rice , washed", "400ml  vegetable or vegan stock", "1 tbsp   red wine vinegar (vegan varieties are readily available)", "2 tbsp caster sugar", "2 spring onions , finely sliced"], "steps": ["Dry-fry the cashews in a large saucepan or casserole dish over a medium heat until golden brown. Remove from the heat, leave to cool, then roughly chop. Heat 1 tbsp oil in the same pan over a high heat, then fry the corn on each side for 20 seconds to char. Remove from the pan, set aside, then tip in the carrots and fry for 5 mins. Remove from the pan and set aside.", "Heat the rest of the oil in the same pan over a medium heat and fry the onions and celery for 10 mins until soft and slightly coloured. Tip in the peppers and garlic, then fry for another 5 mins before adding the Cajun seasoning, smoked paprika, chipotle paste and tomato purée. Fry for 1 min until the spices are fragrant, then add the cherry tomatoes and fry for another 2 mins. ", "Stir in the kidney beans, canned tomatoes, rice, stock, vinegar and sugar, then stir until everything is combined. Bring to the boil, then cover with a lid and simmer with a lid on for 35-40 mins on a medium-low heat, stirring halfway through, until the rice is cooked and liquid absorbed.", "Slice the corn off the cob and mix it through the rice along with the carrots. Season and garnish with the spring onions and cashews.", "Recipe from Good Food magazine, October 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "butternut-squash--sage-macaroni-cheese", "summary": "There's littlemore comforting than a homemade macaroni cheese. This version includes 1 of your 5-a-day, as well as a hint ofsage.", "ingredients": ["1 large butternut squash, deseeded and cut into chunks", "2 tsp olive oil, plus a drizzle", "1 onion, finely chopped", "15 sage leaves, 6 finely chopped", "85g butter", "85g plain flour", "2 tsp English mustard powder", "1l  semi-skimmed milk", "250g pack extra mature or mature cheddar, grated", "50g parmesan (or vegetarian alternative), finely grated", "450g  macaroni"], "steps": ["Recipe from Good Food magazine, December 2015", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "spiced-aubergine-bake", "summary": "This is vegan comfort food at its best. Layer up slices of aubergine with a spicy coconut milk and tomato sauce for a hearty, warming meal", "ingredients": ["4 aubergines, cut into 5mm-1cm slices", "3 tbsp  vegetable oil", "2 tbsp coconut oil", "2 large onions, chopped", "3 garlic cloves, crushed", "1 tbsp  black mustard seeds", "½ tbsp fenugreek seeds", "1 tbsp garam masala", "¼ tsp hot chilli powder", "1 cinnamon stick", "1 tsp ground cumin", "1 tsp  ground coriander", "2 x 400g cans chopped tomatoes", "200ml coconut milk", "sugar, to taste", "2 tbsp flaked almonds", "small bunch   coriander, roughly chopped (optional)"], "steps": ["Heat oven to 220C/200C fan/gas 7. Generously brush each aubergine slice with vegetable oil and place in a single layer on a baking tray, or two if they don’t fit on one. Cook on the low shelves for 10 mins, then turn over and cook for a further 5-10 mins until they are golden. Reduce the oven to 180C/160C fan/gas 4.", "Heat the coconut oil in a large, heavy-based frying pan and add the onions. Cover and sweat on a low heat for about 5 mins until softened. Add the garlic, mustard seeds, fenugreek seeds, garam masala, chilli powder, cinnamon stick, cumin and ground coriander. Cook for a few secs until it starts to smell beautiful and aromatic.", "Pour the chopped tomatoes and coconut milk into the spiced onions and stir well. Check the seasoning and add a little sugar, salt or pepper to taste.", "Spoon a third of the tomato sauce on the bottom of a 2-litre ovenproof dish. Layer with half the aubergine slices. Spoon over a further third of tomato sauce, then the remaining aubergine slices, and finish with the rest of the sauce. Sprinkle over the flaked almonds and coriander (if using), reserving some to serve, and bake for 25-30 mins. Serve garnished with more coriander.", "Recipe from Good Food magazine, October 2015", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "noodles-with-crispy-chilli-oil-eggs", "summary": "Make your own crispy chilli oil and use it to season noodles and pak choi. Top with fried eggs for the ultimate comfort food", "ingredients": ["1 tsp  vegetable oil", "2 heads pak choi, each halved through the core", "2 tsp  Chinese black vinegar", "1 tbsp soy sauce", "1 tsp  sesame oil", "pinch of   sugar", "200g cooked   noodles (I use straight-to-wok noodles, egg, udon or ramen noodles)", "2 large eggs", "4 small shallots, halved and thinly sliced", "1 head of garlic (about 8-10 cloves) thinly sliced", "1 x 10cm cinnamon stick", "4 star anise", "500ml  vegetable oil", "2 tbsp  sesame seeds", "2 tsp cumin seeds", "1 tsp  Szechuan peppercorns", "1 thumb-sized piece ginger, peeled, finely chopped", "30g crushed red chilli flakes", "2 tbsp soy sauce", "1 tbsp caster sugar"], "steps": ["To make the chilli oil, tip the shallots, garlic, cinnamon stick, star anise and oil into a wide pan (a deep frying pan is good), then bring to a gentle sizzle. Cook for 15-20 mins over a low-medium heat, stirring now and again, until the shallots and garlic are crisp and golden brown. They will burn easily if the heat is too high, so watch the pan.", "Meanwhile, toast the sesame seeds in a dry pan until golden, then tip into a bowl and set aside. Put the cumin seeds and Szechuan peppercorns in the pan and toast for 1-2 mins until aromatic. Tip into a pestle and mortar or spice grinder, and grind to a powder. Mix with the toasted sesame seeds.", "Add the ginger, chilli flakes, soy and sugar to the bowl with the toasted, ground spices. When the shallots and garlic are crisp, strain the oil over the bowl using a sieve. Leave the crispy bits of garlic and shallot in the sieve to cool and become even more crisp. Discard the cinnamon and star anise.", "Stir the cooled shallots and garlic through the spiced oil mixture. Will keep chilled for up to two weeks in an airtight, sterilised jar.", "When ready to make the noodles, heat the veg oil in a wok. Add the pak choi and stir-fry for a minute with a splash of water and a pinch of salt. Cover with a lid (or a baking tray if you don’t have one). Steam for a minute, then lift the veg from the wok, letting any liquid drip off. Set aside on a plate. Put the vinegar, soy sauce, sesame oil and sugar in the pan along with 2 tsp of the crispy chilli oil. Bring to a bubble, then add the noodles and toss for a few minutes over a high heat until the sauce is clinging to the noodles and they’re soft and slippery. Divide the noodles between two bowls and put the pak choi on top.", "Wipe out the pan. Add another drizzle of the crispy chilli oil along with about 2 tsp of sediment from the jar. When sizzling, crack in the eggs and fry until crispy around the edge, spooning over the oil as they cook. Slide the fried eggs over the noodles, adding more crispy bits from the jar, if you like.", "Recipe from Good Food magazine, January 2021", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "squash-chickpea--coconut-curry", "summary": "Cook up this vibrant vegan curry that makes the most of autumnal squash. It's ideal for a meat-free Monday dinner when served with flatbreads", "ingredients": ["1 kabocha, red kuri, crown prince or butternut squash , peeled, deseeded, cut into 2cm-thick slices", "3 tbsp coconut or rapeseed oil", "5 tbsp tamarind sauce", "1 tsp chilli flakes", "2 tbsp desiccated coconut", "1 tsp black mustard seeds", "1 tbsp  dried or fresh curry leaves", "1 red onion , sliced", "thumb-sized piece of  ginger , grated", "1 garlic clove , crushed", "1 green chilli , sliced", "1 lemongrass stalk, lightly bashed", "400g can   chickpeas , drained", "1 large tomato , sliced", "1 tbsp   roasted curry powder (see recipe, right)", "1 tsp turmeric , freshly grated if possible, or use 1 tsp ground", "400ml can coconut milk", "3 large handfuls of  kale", "small bunch of    coriander , leaves picked", "2 tbsp toasted coconut flakes (optional)", "flatbreads  , to serve", "10g basmati rice", "20g coriander seeds", "15g cumin seeds", "10g  black peppercorns", "5g fenugreek seeds", "½ tsp cloves", "½ tsp green   cardamom pods, seeds only"], "steps": ["For the curry powder, heat a small frying pan over a medium heat and toast the rice, stirring, until it starts to brown. Tip in the rest of the spices and toast for 3-5 mins until brown but not burned. Using a spice grinder or pestle and mortar, blitz or grind to a fine powder. Pass through a sieve. Will keep for up to three months in an airtight container.", "Heat the oven to 200C/180C fan/gas 6. Toss the squash with 1 tbsp of the oil, a pinch of salt, 3 tbsp of the tamarind sauce, the chilli flakes and coconut. Spread out on a baking sheet and bake for 35-40 mins, or until tender.", "Heat the remaining 2 tbsp oil in a wok over a high heat. Fry the mustard seeds for a minute or so until they sizzle and pop, then add the curry leaves and cook for a few more seconds until they crackle. Add the onion, ginger, garlic, chilli, lemongrass and a pinch of salt and stir for a few minutes until the onion softens. Tip in the chickpeas, tomato, curry powder and turmeric and keep stirring for 5-8 mins, until the tomato breaks down.", "Pour the coconut milk into the wok and stir, cooking for about 5 mins until slightly reduced. Add the remaining 2 tbsp tamarind, taste for seasoning, then add the kale, stirring for a couple of minutes until softened. Divide the squash between bowls, ladle in the curry sauce, then top with the coriander and coconut flakes, if using. Serve with warmed flatbreads.", "You can use the leftover curry powder in other veggie curries, stir it through yogurt for use as a marinade, or mix with olive oil and toss with veg before roasting.", "Chop some squash and mix it through any leftover curry. Tip the mixture into pie dishes, then cover with puff pastry to fit the top of each dish. Brush the pies with beaten egg yolk, then bake at 220C/200C fan/gas 8 for 20 mins until golden and puffed up.", "Recipe from Good Food magazine, October 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "minestrone-soup", "summary": "", "ingredients": [], "steps": ["\n19\n    Recipes\n", "\n\n                    Magazine subscription – 5 issues for only £5 \n                \n", "\n    Make a warming bowl of minestrone soup with plenty of vegetables and pasta. These simple yet versatile recipes are perfect for an easy lunch or filling supper.\n", "\n                                    Whip up this classic Italian vegetable soup with a rich tomato base and pasta. It's low in calories and packed with fibre and vitamin C\n        ", "\n                                    Do something different with a pack of tortellini. This filling soup is full of fibre and veg, plus it's low in fat. The perfect lunch or supper\n        ", "\n                                    Whip up a hearty bowl of soup in next to no time, perfect for a quick lunch or warming supper\n        ", "\n                                    This simple soup makes the most of Spring veg and will become a favourite standby for a quick lunch or supper\n        ", "\n                                    A warm and comforting turkey soup recipe to put your Christmas leftovers to good use. Easy to prepare and low fat, this soup is a perfect post-Christmas pick me up\n        ", "\n                                    Bulk out this chunky vegetable soup with hearty sausage and cannellini beans, then serve with our tapenade ciabatta toasts\n        ", "\n                                    Keep the winter out and warmth in with nutritious minestrone and pesto croûtes\n        ", "\n                                    A vegetarian favourite for under 5's, minestrone pasta pot\n        ", "\n                                    A really thick, filling minestrone soup - tastes even better after a day\n        ", "\n                                    Enjoy this three bean minestrone soup as a healthy lunch or supper. Full of protein, it will keep you going through the day and contains 3 of your 5-a-day\n        ", "\n                                    Using a selection of green vegetables gives this soup a summery feel and contrasting textures\n        ", "\n                                    Make this minestrone soup with pancetta, macaroni, fennel and peas for a hearty lunch or easy midweek dinner. Serve with pesto and crusty bread\n        ", "\n                                    A healthy summer soup - based on an Italian classic and packed with greens, it's a good source of fibre and vitamin C\n        ", "\n                                    This wholesome soup is packed full of greens and takes just 10 minutes to knock up\n        ", "\n                                    A generous grating of parmesan balances the citrus in this fresh, healthy pesto soup. A simple veggie supper you can serve with fluffy garlic flatbreads\n        ", "\n                                    Our easy minestrone soup makes a filling lunch or a satisfying supper, served with fresh bread. This simple bowl of goodness is packed with nutritious veg\n        ", "\n                                    Warm up your week with this good-for-you vegetable soup that's easy to freeze ahead\n        ", "\n                                    Rustle up an Italian-style minestrone soup and individual tarts using ingredients from your storecupboard\n        ", "\n                                    This is the perfect welcome-home warmer after a cold country walk, simply add some crusty bread\n        ", "Subscription offer: Try 5 issues for £5!"]}, {"title_": "pumpkin-curry-with-chickpeas", "summary": "A veggie dinner party dish which stands alone as a vegan main course or as a complex side dish perfect served with spiced roast meat or fish.", "ingredients": ["1 tbsp sunflower oil", "3 tbsp   Thai yellow curry paste, or vegetarian alternative", "2 onions, finely chopped", "3 large stalks lemongrass, bashed with the back of a knife", "6  cardamom pods", "1 tbsp  mustard seed", "1 piece pumpkin or a small squash (about 1kg)", "250ml  vegetable stock", "400ml can reduced-fat coconut milk", "400g   can chickpea, drained and rinsed", "2 limes", "large handful mint leaves", "naan bread,  to serve"], "steps": ["Heat the oil in a sauté pan, then gently fry the curry paste with the onions, lemongrass, cardamom and mustard seed for 2-3 mins until fragrant. Stir the pumpkin or squash into the pan and coat in the paste, then pour in the stock and coconut milk. Bring everything to a simmer, add the chickpeas, then cook for about 10 mins until the pumpkin is tender. The curry can now be cooled and frozen for up to 1 month.", "Squeeze the juice of one lime into the curry, then cut the other lime into wedges to serve alongside. Just before serving, tear over mint leaves, then bring to the table with the lime wedges and warm naan breads.", "Recipe from Good Food magazine, October 2008", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "gnocchi--tomato-bake", "summary": "A comforting veggie main packed with rich Italian flavours", "ingredients": ["1 tbsp olive oil", "1 onion, chopped ", "1 red pepper, deseeded and finely chopped", "1 garlic clove, crushed", "400g can  chopped tomatoes", "500g pack gnocchi", "handful  basil leaves, torn", "half a ball   mozzarella, torn into chunks"], "steps": ["Heat grill to high. Heat 1 tbsp olive oil in a large frying pan, then soften 1 chopped onion and 1 finely chopped red pepper for 5 mins.", "Stir in 1 crushed garlic clove, fry for 1 min, tip in 400g chopped tomatoes and 500g gnocchi, then bring to a simmer.", "Bubble for 10-15 mins, stirring occasionally, until the gnocchi is soft and the sauce has thickened.", "Season, stir through a handful of torn basil leaves, then transfer to a large ovenproof dish.", "Scatter with torn chunks of half a 125g mozzarella ball, then grill for 5-6 mins until the cheese is bubbling and golden.", "Recipe from Good Food magazine, September 2008", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "spiced-lentil--spinach-pies", "summary": "Try these vegetarian pies with a spiced pastry glaze and surprise chutney middle. The lentils not only soak up all the flavours, they're filling and good for you, too", "ingredients": ["1 tbsp sunflower oil", "1 large onion , finely chopped", "5 garlic cloves , grated", "thumb-sized piece of ginger , peeled and finely grated", "1 tsp cumin", "1½ tsp turmeric", "½ cinnamon stick", "pinch of chilli flakes", "250g red split lentils", "600ml  vegetable stock", "30g butter", "300g spinach", "1 lemon , zested and juiced", "2 tbsp  chopped coriander", "6 tbsp chutney", "1 quantity all-butter    pie pastry (see 'Goes well with' below), or use a shop-bought vegetarian alternative ", "3 egg yolks", "½ tsp turmeric", "1 tsp cumin seeds", "1 tsp   sea salt flakes"], "steps": ["Heat the oil in a wide-based pan. Add the onion and cook over a low heat for 10 mins, stirring, until softened. Mix in the garlic, ginger and spices and cook for 1 min more. Tip in the lentils, pour over the vegetable stock, season and bring to the boil. Reduce the heat, then cover and cook for 20 mins until the lentils are tender.", "Meanwhile, heat half the butter in a large pan, add the spinach and cook until wilted. Season, then drain. Stir the spinach through the lentils with the lemon zest and juice and coriander, then leave to cool.", "Mix together all the ingredients for the egg wash. Assemble the pies as directed in the pastry recipe, adding a spoonful of chutney to the middle of each. Glaze with the spiced egg wash before baking.", "Recipe from Good Food magazine, October 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "coconut-rum--raisin-rice-pudding", "summary": "Toast rice in brown butter, cook in coconut cream and lace with rum and raisin syrup to make this rice pudding. It's a world away from school-dinner versions", "ingredients": ["50g butter", "150g  short-grain pudding rice", "150g golden caster sugar", "2 x 400ml cans coconut milk", "300ml double cream , plus a little extra", "1 tsp vanilla extract", "150ml spiced rum", "100g muscovado sugar", "100g  raisins"], "steps": ["For the rum & raisin syrup, tip all the ingredients into a large saucepan and heat gently over a low heat for 5 mins, or until the sugar has dissolved and created a syrup and the raisins have plumped up. Tip into a bowl, cover and set aside.", "In the same saucepan (there’s no need to clean it) melt the butter over a medium heat until sizzling, then scatter over the rice and toast in the hot butter until the butter is just starting to brown. Stir in the sugar, then pour over the coconut milk, cream and vanilla. Bring to a simmer and continue to cook gently for 40-45 mins until the rice is tender, adding a splash more cream if it becomes too thick.", "To serve hot, stir a third of the rum & raisin syrup through the pudding and spoon the rest over the top. To serve cold, leave the pudding to cool, then chill in the fridge to firm up so that you can serve it in scoops with the rum & raisin syrup spooned over.", "Stir chopped mango through any leftover coconut rice pudding that has been chilled in the fridge. Serve in scoops scattered with toasted coconut flakes, if you have any. ", "Stir chopped mango through any leftover coconut rice pudding that has been chilled in the fridge. Serve in scoops scattered with toasted coconut flakes, if you have any. ", "Recipe from Good Food magazine, October 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "spinach--ricotta-cannelloni", "summary": "Keep a few portions of this vegetarian classic in the freezer and you'll never be stuck for a satisfying supper", "ingredients": ["3 tbsp olive oil", "8 garlic cloves, crushed", "3 tbsp caster sugar", "2 tbsp  red wine vinegar", "4 x 400g cans chopped tomatoes", "small bunch basil leaves", "2 x 250g tubs  mascarpone", "3 tbsp milk", "85g parmesan (or vegetarian alternative), grated", "2 x 125g balls   mozzarella, sliced", "1kg spinach", "100g parmesan (or vegetarian alternative), grated", "3 x 250g tubs ricotta", "large pinch grated nutmeg", "400g  dried cannelloni"], "steps": ["First make the tomato sauce. Heat the oil in a large pan and fry the garlic for 1 min. Add the sugar, vinegar, tomatoes and some seasoning and simmer for 20 mins, stirring occasionally, until thick. Add the basil and divide the sauce between 2 or more shallow ovenproof dishes (see Tips for freezing, below). Set aside. Make a sauce by beating the mascarpone with the milk until smooth, season, then set aside.", "Put the spinach in a large colander and pour over a kettle of boiling water to wilt it (you may need to do this in batches). When cool enough to handle squeeze out the excess water. Roughly chop the spinach and mix in a large bowl with 100g Parmesan and ricotta. Season well with salt, pepper and the nutmeg.", "Heat oven to 200C/180C fan/gas 6. Using a piping bag or plastic food bag with the corner snipped off, squeeze the filling into the cannelloni tubes. Lay the tubes, side by side, on top of the tomato sauce and spoon over the mascarpone sauce. Top with Parmesan and mozzarella. You can now freeze the cannelloni, uncooked, or you can cook it first and then freeze. Bake for 30-35 mins until golden and bubbling. Remove from oven and let stand for 5 mins before serving.", "Recipe from Good Food magazine, June 2010", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "frozen-pumpkin-cheesecake", "summary": "Swap your usual pumpkin pie for our no-bake, make-ahead cheesecake. It's perfect for Halloween or Bonfire Night, or as an autumn dessert for the dinner table", "ingredients": ["300g  gingernut biscuits", "350ml maple syrup , plus extra to serve", "350g  full-fat cream cheese", "300g  pumpkin purée", "300ml double cream"], "steps": ["Blitz 250g of the biscuits in a food processor with 125ml of the syrup until it resembles fine crumbs. Line a 20cm springform tin with baking parchment, then firmly push the crumbs into the base, transfer to the fridge and chill for 30 mins.", "Beat 100ml of the syrup with the cheese and pumpkin until smooth. Whip 200ml of the cream with 100ml of the syrup to soft peaks. Fold into the cream cheese mixture, then spoon over the base and level the top. Cover and freeze overnight. ", "Lightly whip the remaining cream with the remaining syrup and dollop over the cheesecake. Crumble over the remaining biscuits and drizzle over some extra syrup. Leave to rest for 5 mins before serving.", "Try using speculoos biscuits in the crust for a spiced flavour.", "Try using speculoos biscuits in the crust for a spiced flavour.", "Recipe from Good Food magazine, October 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "leek-cheese--potato-pasties", "summary": "Mini veggie pastry parcels with oozing cheese make a great value and comforting homemade snack", "ingredients": ["2   small potatoes (about 300g/11oz), cut into 1cm cubes", "knob of  butter", "2 small leeks , tough outer leaves removed, split in half lengthways and finely sliced", "3 thyme sprigs, leaves chopped", "1 tbsp Dijon mustard", "2 tbsp cream", "flour , for dusting", "500g  block shortcrust pastry", "140g/ 5oz   Welsh Caerphilly cheese, strong cheddar or vegetarian alternative, cut into small chunks", "1 egg , beaten"], "steps": ["Cook the potatoes in boiling, salted water for 5-8 mins until tender, but still holding their shape. Meanwhile, melt the butter in a large saucepan. Add the leeks and thyme and soften for 10-12 mins. Drain potatoes and add to the leeks with the mustard and plenty of seasoning. Stir in the cream and leave to cool a little.", "Heat oven to 180C/160C fan/gas 4. On a floured surface, roll out the pastry to the thickness of a £1 coin. Use a side plate or a bowl as a template to cut out 6 x 15cm circles. Mix the cheese with the leek mixture and pile a mound of the mix onto the centre of each pastry circle. Brush around edges with a little egg, then bring edges together and crimp with your fingers to seal.", "Place pasties on a baking tray lined with baking parchment, brush with the remaining egg and bake for 40-45 mins until golden brown. Serve warm or leave to cool.", "Recipe from Good Food magazine, March 2012", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "potato-curry-with-lime--cucumber-raita", "summary": "This colourful Indian dish with a refreshing yoghurt sauce is great for vegetarians, or try serving to meat eaters with lightly spiced lamb", "ingredients": ["2 tbsp vegetable or sunflower oil", "1 tbsp  brown or black mustard seeds", "3 long dried red Indian chillies", "12-15 curry leaves", "2 onions , sliced", "2 tsp  ground coriander", "2 tsp garam masala", "2 tsp turmeric", "500g tomatoes , quartered", "800g   potatoes , peeled and cut into very large chunks", "400g can coconut milk", "chapatis, rotis or naan bread  , to serve", "150g pot natural yogurt", "zest and juice 1 lime", "½ cucumber  , deseeded and coarsely grated", "small handful   coriander leaves, roughly chopped"], "steps": ["Heat the oil in a large pan and fry the mustard seeds, chillies and curry leaves until the seeds start to pop. Add the onions and fry until softened and starting to brown. stir in the spices, add the tomatoes and fry for 5 mins. Add the potatoes and stir to coat. Pour in the coconut milk with 200ml water. Bring to the boil and simmer for 20-25 mins, stirring occasionally, until the potatoes are just tender.", "To make the raita, mix all the ingredients together with some seasoning.", "If the curry looks a little too saucy, scoop out the potatoes with a slotted spoon into another dish, then boil the sauce until reduced a little. stir the potatoes back in to heat through, and season well (this curry needs a good sprinkling of salt). serve with warmed Indian bread and a dollop of raita.", "If you're missing the meat, this curry is also delicious served with some spiced lamb chops or slow-roasted spiced lamb leg.", "Recipe from Good Food magazine, November 2011", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "spiced-lentil--butternut-squash-soup", "summary": "Cooka big batch of this fillingspicedlentil andsquash soup andfreeze the leftovers for a speedy supper another day. It's healthy and low in fat", "ingredients": ["2 tbsp olive oil", "2 onions, finely chopped", "2 garlic cloves, crushed", "¼ tsp hot chilli powder", "1 tbsp  ras el hanout", "1 butternut squash, peeled and cut into 2cm pieces", "100g red lentils", "1l  hot vegetable stock", "1 small bunch   coriander, leaves chopped, plus extra to serve", "dukkah  (see tip) and natural yogurt, to serve"], "steps": ["Heat the oil in a large flameproof casserole dish or saucepan over a medium-high heat. Fry the onions with a pinch of salt for 7 mins, or until softened and just caramelised. Add the garlic, chilli and ras el hanout, and cook for 1 min more.", "Stir in the squash and lentils. Pour over the stock and season to taste. Bring to the boil, then reduce the heat to a simmer and cook, covered, for 25 mins or until the squash is soft. Blitz the soup with a stick blender until smooth, then season to taste. To freeze, leave to cool completely and transfer to large freezerproof bags.", "Stir in the coriander leaves and ladle the soup into bowls. Serve topped with the dukkah, yogurt and extra coriander leaves.", "Recipe from Good Food magazine, September 2019", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}, {"title_": "wild-mushroom--chestnut-cottage-pie", "summary": "Use penny buns or mixed wild mushrooms for this rich and earthy vegetarian recipe", "ingredients": ["2 tbsp  vegetable oil", "2 carrots , chopped", "½ swede , chopped", "12 pearl onions , peeled and left whole", "1 garlic clove , crushed", "1 rosemary sprig", "1 tsp  tomato purée", "1 tsp yeast extract, such as Marmite", "200g can chopped tomatoes", "50ml  white wine", "175ml  vegetable stock", "500g fresh penny buns/ceps or mixed wild mushrooms , roughly chopped", "200g vacumn-packed chestnuts , halved", "3   potatoes , diced", "2 parsnips , diced", "2 carrots , diced", "300g celeriac , diced", "100g butter", "50ml milk"], "steps": ["Heat the oil in a large frying pan, add the carrot, swede and onions, and cook for 8 mins. Add the garlic, rosemary, tomato purée and yeast extract, and cook for a further 5 mins. Add the tomatoes and white wine and scrape all the goodness off the bottom of the pan. Pour in the stock, add the mushrooms and chestnuts, then simmer for 8 mins until the sauce is reduced and thickened. Remove from the heat and allow to cool slightly.", "Meanwhile, to make the topping, put all the vegetables in a large pan of salted water and bring to the boil. Cook for 12 mins or until the vegetables are tender. Drain, then allow to steam-dry for 5 mins. Roughly mash the roots with the butter, milk and some seasoning.", "Heat oven to 190C/170C fan/gas 5. Pile the mushroom mixture into an ovenproof dish, top with the mash, then cook for 30 mins until golden and bubbling. Serve with some buttered greens, if you like.", "Recipe from Good Food magazine, October 2011", "Exclusive offer from Good Food Deals:\r\nSave up to £126 on a Double Seater Egg Chair\r\n"]}]